namespace Yashil.Core.CustomViewModels
{
    /// <summary>
    /// کلاس توکن احراز هویت خارجی
    /// این کلاس برای فرایندی استفاده میشود که یک سامانه خارجی از زیر ساخت موجود
    /// تقاضای احراز هویت میکند
    /// پس از احراز هویت و ارسال آن به درخواست کننده احراز هویت
    /// وی وظف است که توکن را مجددا به سمت ما بوسیله توکن VerifyToken بفرستد
    /// این متد ورودی دریافت میکند که کلاس ورودی آن ExternalToken میباشد
    /// </summary>
    public class ExternalToken
    {
        /// <summary>
        /// توکنی که توسط زیر ساخت به سامانه خارجی ارسال میشود
        /// این توکن باید توسط سامانه به سمت ما مجددا ارسال شود تا 
        /// ما آنرا بررسی کنیم
        /// </summary>
        public string Token { get; set; }
    }
}
